/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   pipex.c                                            :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: sujilee <sujilee@student.42.fr>            +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2022/02/13 09:13:59 by sujilee           #+#    #+#             */
/*   Updated: 2022/02/13 09:37:40 by sujilee          ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "../includes/pipex.h"

int	main(int argc, char **argv, char **envp)
{
	t_pipe	mypipe;
	
	if (argc != 5)
		//에러 출력. 리턴
	//mypipe 초기화
	//파싱함수
	//pipex 동작
	//끝
	return (0);
}